# Homebrew dependencies for this dotfiles repo.
# Apply with: ./install.sh --deps   (or: brew bundle --file="$HOME/.config/Brewfile")
#
# Curated on purpose: only tools the configs in this repo actually reference.
# Project-specific build deps do not belong here.

tap "anomalyco/tap"

# --- CLI core ---
brew "neovim"
brew "tmux"
brew "lazygit"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "gh"
brew "ghq"
brew "jq"
brew "git-flow"
brew "tree-sitter-cli"
brew "lynx"
brew "pngpaste"
brew "luarocks"
brew "nodebrew"
brew "mise"
brew "anomalyco/tap/opencode"

# --- GUI apps / fonts (casks land in /Applications, shared across users) ---
cask "font-hack-nerd-font"
cask "ghostty"
cask "claude"    # Claude Desktop (Claude Code CLI is installed separately, see README)
cask "codex"     # Codex CLI
cask "codex-app" # Codex desktop app
